Revit 2025 API
CableTrayShape Enumeration
 Shape types enum of cable tray
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum CableTrayShape
Public Enumeration CableTrayShape
public enum class CableTrayShape
type CableTrayShape
Members
Member name | Value | Description
Invalid | 0 |  Invalid cable tray shape.
Channel | 1 |  Channel cable tray shape.
Ladder | 2 |  Ladder cable tray shape.
See Also
Reference
Autodesk.Revit.DB.Electrical Namespace